; domain
;; The gripper domain of Lecture 7, in the untyped STRIPS subset the lecture uses.
;; Types are unary predicates here: (room ?r) asserts that ?r is a room.
(define (domain gripper)
  (:requirements :strips)
  (:predicates (room ?r) (ball ?b) (gripper ?g)
               (at-robby ?r) (at-ball ?b ?r) (free ?g) (carry ?g ?b))

  (:action move
    :parameters (?x ?y)
    :precondition (and (room ?x) (room ?y) (at-robby ?x))
    :effect (and (at-robby ?y) (not (at-robby ?x))))

  (:action pick-up
    :parameters (?x ?y ?z)
    :precondition (and (ball ?x) (room ?y) (gripper ?z)
                       (at-ball ?x ?y) (at-robby ?y) (free ?z))
    :effect (and (carry ?z ?x) (not (at-ball ?x ?y)) (not (free ?z))))

  (:action drop
    :parameters (?x ?y ?z)
    :precondition (and (ball ?x) (room ?y) (gripper ?z)
                       (carry ?z ?x) (at-robby ?y))
    :effect (and (at-ball ?x ?y) (free ?z) (not (carry ?z ?x))))
)

; problem
;; Two balls, one gripper, two rooms. Small enough to compute a heuristic by hand.
(define (problem two-balls)
  (:domain gripper)
  (:objects rooma roomb ball1 ball2 left)
  (:init (room rooma) (room roomb) (ball ball1) (ball ball2) (gripper left)
         (at-robby rooma) (at-ball ball1 rooma) (at-ball ball2 rooma) (free left))
  (:goal (and (at-ball ball1 roomb) (at-ball ball2 roomb)))
)

; plan
1. (pick-up ball1 rooma left)
   deleted: (at-ball ball1 rooma) (free left)
   added: (carry left ball1)
   goals met: 0 of 2
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 2
3. (drop ball1 roomb left)
   deleted: (carry left ball1)
   added: (at-ball ball1 roomb) (free left)
   goals met: 1 of 2
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 1 of 2
5. (pick-up ball2 rooma left)
   deleted: (at-ball ball2 rooma) (free left)
   added: (carry left ball2)
   goals met: 1 of 2
6. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 1 of 2
7. (drop ball2 roomb left)
   deleted: (carry left ball2)
   added: (at-ball ball2 roomb) (free left)
   goals met: 2 of 2
